uhnp/src/Enums/СтатусыПубликацииЗакупок/СтатусыПубликацииЗакупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПубликацииЗакупок</name>
  <enumValues>
    <name>НеЗарегистрирована</name>
  </enumValues>
  <enumValues>
    <name>ЗарегистрированЧерновик</name>
  </enumValues>
  <enumValues>
    <name>ОпубликованаИдетСборЗаявок</name>
  </enumValues>
  <enumValues>
    <name>ПолученыПредложенияПоставщиков</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытаУспешно</name>
  </enumValues>
  <enumValues>
    <name>Приостановлена</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытаОтказ</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СтатусыПубликацииЗакупок/ManagerModule.bsl
#Если НаСервере Тогда
Функция ПолучитьСтатусыЗакрытыхПубликаций() Экспорт
	мСтатусыЗакрытыхПубликаций = Новый Массив;
	мСтатусыЗакрытыхПубликаций.Добавить(Перечисления.СтатусыПубликацииЗакупок.ЗакрытаОтказ);
	мСтатусыЗакрытыхПубликаций.Добавить(Перечисления.СтатусыПубликацииЗакупок.ЗакрытаУспешно);
	мСтатусыЗакрытыхПубликаций.Добавить(Перечисления.СтатусыПубликацииЗакупок.Отменена);
	Возврат мСтатусыЗакрытыхПубликаций;
КонецФункции

Функция ЭтоСтатусЗакрытойПубликации(СтатусДляПроверки) Экспорт
	мСтатусыЗакрытыхПубликаций = ПолучитьСтатусыЗакрытыхПубликаций();
	Возврат мСтатусыЗакрытыхПубликаций.Найти(СтатусДляПроверки) <> Неопределено;
КонецФункции

#КонецЕсли
